In [1]:
import pandas as pd

In [2]:
info = {
    "Name": ["Rahul", "Harshita", "Shradha"],
    "CGPA": [9.5, 7.5, 8.5]
}
df = pd.DataFrame(info)
print(df)

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2   Shradha   8.5

In [3]:
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2   Shradha   8.5

In [4]:
list=pd.Series([1,2,3,4,5])
print(list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
print(list[0])

1

In [7]:
list=pd.Series([1,2,3,4,5],index=(["Vanshika","Vansh","Shruti","Apoorva","Kashish"]))
print(list)

Vanshika    1
Vansh       2
Shruti      3
Apoorva     4
Kashish     5
dtype: int64

In [8]:
list1=pd.Series([1,2,3,4,5])
list2=pd.Series([1,2,3,4,5])
print(list1+list2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [9]:
info = {
    "Name": ["Rahul", "Harshita", "Shradha"],
    "Age":[24,23,26],
    "CGPA": [9.5, 7.5, 8.5]
}
df = pd.DataFrame(info)
print(df)

       Name  Age  CGPA
0     Rahul   24   9.5
1  Harshita   23   7.5
2   Shradha   26   8.5

In [12]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [16]:
data=[
    ["Vanshika", 9.1],
    ["Vansh", 8.5],
    ["Shruti", 8.9],
    ["Apoorva", 9.3],
    ["Kashish", 8.9]
]
df = pd.DataFrame(data, columns=["Name", "CGPA"])
print(df)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.9

In [17]:
df

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.9

In [24]:
import numpy as np
np_array=np.array([[1,3,4],[7,1,5],[2,4,7]])
df = pd.DataFrame(np_array)
print(df)

   0  1  2
0  1  3  4
1  7  1  5
2  2  4  7

In [25]:
df

   0  1  2
0  1  3  4
1  7  1  5
2  2  4  7

In [32]:

data = [
    ["Vanshika", 9.1],
    ["Vansh", 8.5],
    ["Shruti", 8.9],
    ["Apoorva", 9.3],
    ["Kashish", 8.7]
]

dataframe = pd.DataFrame(data, columns=["Name", "CGPA"])


dataframe.to_json("students.json", orient="records", indent=4)
dataframe.to_csv("students.csv", index=False)

In [34]:
dataframe=pd.read_csv("students.csv")
print(dataframe)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [35]:
dataframe=pd.read_json("students.json")
print(dataframe)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [36]:

dataframe.tail(2)

      Name  CGPA
3  Apoorva   9.3
4  Kashish   8.7

In [37]:
dataframe.head(2)

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5

In [49]:
dataframe.sample()

     Name  CGPA
2  Shruti   8.9

In [45]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   CGPA    5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 212.0+ bytes

In [51]:
dataframe.shape

(5, 2)

In [52]:
dataframe.describe()

           CGPA
count  5.000000
mean   8.900000
std    0.316228
min    8.500000
25%    8.700000
50%    8.900000
75%    9.100000
max    9.300000

In [53]:
dataframe.columns

Index(['Name', 'CGPA'], dtype='object')

In [54]:
dataframe.nunique()

Name    5
CGPA    5
dtype: int64

In [55]:

df = pd.read_csv("st.csv")
df

       Name  CGPA
0  Vanshika   9.1
1     Vansh   8.5
2    Shruti   8.9
3   Apoorva   9.3
4   Kashish   8.7

In [61]:
df = pd.read_csv("globalAirQuality.csv")
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [ ]:
df.country